## pandas

Pandas提供DataFrame数据结构，与R中的data.frame类似。内含常用的分组统计，缺失值处理等操作，包括DataFrame的读写和各种类型的转换

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

## series

In [4]:
a = [4, 7, -5, 3]
a

[4, 7, -5, 3]

In [5]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

左边表示index，右边表示对应的value。可以通过value和index属性查看，index有点像spss里的casenum或者R里自动在表格最左列生成的序号

也可以自己指定index的label：

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

### 读取
可以用index的label来选择：

In [10]:
obj2['b']

7

In [11]:
obj2[['c', 'a', 'd']]
# R language : obj2[c('c','a','d')]

c    3
a   -5
d    4
dtype: int64

依照一定条件读取

In [12]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

### 改变

In [13]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj2

Bob      6
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 运算

In [15]:
obj2 * 2

Bob      12
Steve    14
Jeff    -10
Ryan      6
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

Bob       403.428793
Steve    1096.633158
Jeff        0.006738
Ryan       20.085537
dtype: float64

### 找特定的索引是否存在

In [17]:
'b' in obj2

False

### 很像有固定顺序的dict

In [30]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah': 5000}

In [31]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
obj3['Ohio']

35000

In [33]:
states = [ 'Utah','Ohio', 'Oregon', 'Texas']
obj3[states]

Utah       5000
Ohio      35000
Oregon    16000
Texas     71000
dtype: int64

In [34]:
states = [ 'California','Ohio', 'Oregon', 'Texas']

In [35]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### 检查缺失:pd.isnull()

In [36]:
pd.isnull(obj3)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

series里也有相应的方法，series是一个类

In [37]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

### 对齐并执行运算

In [38]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 命名

In [41]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [42]:
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
obj4.index.name = 'state'
#obj4.value.name = 'pop'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## DataFrame
DataFrame就像SPSS的数据文件、R的数据框，SAS的dataset

### 用dict构建DataFrame

In [44]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

可以改变变量的顺序

In [46]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])
#pd.DataFrame(data, columns = [ 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

增加索引，类似R里的rowname  
注意，这里增加了一个新变量debt

In [47]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [48]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

自动识别缺失

In [49]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9, 2003:3.2},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     3.2   NaN
2000     NaN   1.5

挑选子集

In [51]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     3.2   NaN
2000     NaN   1.5

In [52]:
frame3['Nevada'][:2]

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [53]:
frame3[:2]['Nevada']

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [54]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:3]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.2

In [55]:
import pandas as pd
data = {'事件':{1655:'韦小宝出生', 1669:'康熙韦小宝擒鳌拜', 1670:'韦小宝出任天地会青木堂堂主', 1698:'武当掌门陆菲青出生',
             1711:'雍正与海宁陈家掉包出生的儿女', 1733:'陈家洛出生', 1735:'弘历登基，是为乾隆', 1753:'苗人凤和胡一刀决战', 
             1758:'回部霍青桐大败清军', 1759:'香香公主自杀', 1780:' 苗人凤和胡斐决战', 1924:'金庸出生', 2018:'金庸去世'}}

df = pd.DataFrame(data)
df

                  事件
1655           韦小宝出生
1669        康熙韦小宝擒鳌拜
1670   韦小宝出任天地会青木堂堂主
1698       武当掌门陆菲青出生
1711  雍正与海宁陈家掉包出生的儿女
1733           陈家洛出生
1735       弘历登基，是为乾隆
1753       苗人凤和胡一刀决战
1758       回部霍青桐大败清军
1759          香香公主自杀
1780        苗人凤和胡斐决战
1924            金庸出生
2018            金庸去世

练习：  
把下面的数据整理成DataFrame  

2013 “精准扶贫”概念首次被提出  
2016 提出了2020年前实现“两不愁三保障”的扶贫攻坚总目标   
2017 “精准脱贫”列为决胜全面建设小康社会的三大攻坚战之一    
2020 持续巩固拓展脱贫攻坚成果，做好同乡村振兴有效衔接     
2021 国家乡村振兴局成立

### 用numpy创建DataFrame
指定行名和列明

In [ ]:
import numpy as np

In [ ]:
np.arange(9)

In [ ]:
np.arange(9).reshape(3, 3)

In [56]:
frame4 = pd.DataFrame(np.arange(9).reshape(3, 3),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame4

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

### 命名和单元格值

In [57]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     3.2   NaN
2000     NaN   1.5

In [58]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2003      3.2   NaN
2000      NaN   1.5

In [59]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [3.2, nan],
       [nan, 1.5]])

In [60]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [61]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### 读取任意列

In [62]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [63]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [64]:
frame2.iloc[1:3,0:2]

       year state
two    2001  Ohio
three  2002  Ohio

In [65]:
frame2.iloc[:,1]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [66]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

### 删除任意列

In [67]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [68]:
del frame2['year']

In [69]:
frame2.columns

Index(['state', 'pop', 'debt'], dtype='object')

In [70]:
frame2

        state  pop debt
one      Ohio  1.5  NaN
two      Ohio  1.7  NaN
three    Ohio  3.6  NaN
four   Nevada  2.4  NaN
five   Nevada  2.9  NaN
six    Nevada  3.2  NaN

### 读取任意行：.loc[]

loc[]主要是基于标签索引的，也可以用于布尔值

In [72]:
frame2.loc['three']

state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

### 改变DataFrame的值

In [73]:
frame2['debt'] = 16.5
frame2

        state  pop  debt
one      Ohio  1.5  16.5
two      Ohio  1.7  16.5
three    Ohio  3.6  16.5
four   Nevada  2.4  16.5
five   Nevada  2.9  16.5
six    Nevada  3.2  16.5

In [74]:
frame2['debt'] = np.arange(6.)
frame2

        state  pop  debt
one      Ohio  1.5   0.0
two      Ohio  1.7   1.0
three    Ohio  3.6   2.0
four   Nevada  2.4   3.0
five   Nevada  2.9   4.0
six    Nevada  3.2   5.0

### series合进DataFrame
把series赋给DataFrame，会按DataFrame的index来合并，不够的地方用缺失数据来表示：

In [75]:
val = pd.Series([-1.2, -1.5, -1.7], index=['six','seven', 'eight'])
val

six     -1.2
seven   -1.5
eight   -1.7
dtype: float64

In [76]:
frame2['debt'] = val
frame2

        state  pop  debt
one      Ohio  1.5   NaN
two      Ohio  1.7   NaN
three    Ohio  3.6   NaN
four   Nevada  2.4   NaN
five   Nevada  2.9   NaN
six    Nevada  3.2  -1.2

如果列不存在，赋值会创建一个新列

In [77]:
frame2.state == 'Ohio'

one       True
two       True
three     True
four     False
five     False
six      False
Name: state, dtype: bool

In [78]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

        state  pop  debt  eastern
one      Ohio  1.5   NaN     True
two      Ohio  1.7   NaN     True
three    Ohio  3.6   NaN     True
four   Nevada  2.4   NaN    False
five   Nevada  2.9   NaN    False
six    Nevada  3.2  -1.2    False

### DataFrame的转置

In [79]:
# transpose
frame2.T

          one   two three    four    five     six
state    Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9     3.2
debt      NaN   NaN   NaN     NaN     NaN    -1.2
eastern  True  True  True   False   False   False

## 基本功能

### 再索引

#### 对seriex再索引

In [80]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

调用reindex改变index，如果没有对应index的话会引入缺失数据

In [81]:
obj2 = obj.reindex(['d', 'b', 'c', 'a', 'e'])
obj2

d    4.5
b    7.2
c    3.6
a   -5.3
e    NaN
dtype: float64

注意和list中排序的区别  
+ list中，无论是sort还是sorted都是对item进行排序，一般是按照自然顺序进行排序  
+ panda中的reindex是按照给定的index进行排序

In [82]:
students = ['韩梅梅', '李雷', '林涛','Jim','Kate','Lucy']
students.sort()
for student in students:
    print(student)
    
print(students)

Jim
Kate
Lucy
李雷
林涛
韩梅梅
['Jim', 'Kate', 'Lucy', '李雷', '林涛', '韩梅梅']

reindex还可以通过method实现自动填充的功能

In [83]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [84]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [85]:
# obj3.reindex(range(6), method='ffill')

# obj3.reindex(range(6), method='bfill')

obj3.reindex(range(6), method='nearest')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5    yellow
dtype: object

#### 对DataFrame再索引

In [88]:
frame4 = pd.DataFrame(obj)
frame4

     0
d  4.5
b  7.2
a -5.3
c  3.6

##### 对行进行再索引

In [87]:
frame5 = frame4.reindex(['a', 'b', 'c', 'd'])
frame5

     0
a -5.3
b  7.2
c  3.6
d  4.5

可以直接用.loc

In [89]:
frame5.loc[['a', 'b', 'c', 'd']]
frame5

     0
a -5.3
b  7.2
c  3.6
d  4.5

##### 对列进行排序

In [90]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

之前介绍过的方法：直接指定列名的顺序

In [94]:
# frame5 = frame4.reindex(['a', 'b', 'c', 'd'])
pd.DataFrame(frame, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

也可以用reindex函数

In [96]:
frame.reindex(columns = ['state','year','pop'])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 删除记录

#### 对series删除记录

In [97]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj.drop(['d', 'c'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [98]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

直接删，并不会改变series的值

In [99]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [100]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

添加了inplace=False，则会改变原series的值

In [101]:
obj.drop('a', inplace=True)
obj

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

#### 对DataFrame删除行列

In [102]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### 删除行

In [103]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### 删除列
选择axis=1或axis='columns'

In [105]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [106]:
data.drop('Ohio', axis=0)

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.drop(['Ohio'], axis='rows')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 索引、选择、过滤

### 索引

#### 对series索引

In [109]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [110]:
obj['b']

1.0

In [111]:
obj[1]

1.0

In [112]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [113]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [114]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

和数字索引不同，用行名来索引时，会包括尾索引

In [115]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [116]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

#### 对DataFrame索引

##### 索引列

In [117]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [119]:
data.iloc[:,1]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [120]:
data.two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [121]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [122]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data[data['three'] > 5]['two']

Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [124]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [125]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### 索引行

In [126]:
data[0:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

### 选择

In [127]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data[data['three'] > 5]['two']

Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [129]:
data.loc['Colorado']['two']

5

In [130]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

用label切片

In [131]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [132]:
data.loc['Colorado':'New York','three':'four']

          three  four
Colorado      6     7
Utah         10    11
New York     14    15

In [133]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [135]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [136]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

### 整数索引的问题

In [137]:
ser = pd.Series(np.arange(3.))

In [138]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [139]:
ser[1]

1.0

In [140]:
ser[-1]

KeyError: -1

In [142]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [143]:
ser2[-1]

2.0

## 计算和数据对齐

### series的对齐

In [144]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [145]:
s2 = pd.Series([2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a    2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [146]:
s1 + s2

a    9.4
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

### DataFrame的对齐

#### 带缺失的对齐计算

In [147]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [148]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [149]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [150]:
df1 = pd.DataFrame({'A': [1, 2]})
df1

   A
0  1
1  2

In [151]:
df2 = pd.DataFrame({'B': [3, 4]})
df2

   B
0  3
1  4

In [152]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

#### 填补缺失的对齐计算

In [153]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), 
                   columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [154]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), 
                   columns=list('abcde'))

df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [155]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [156]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [157]:
df1.add(df2, fill_value=0)
# R na.rm=True

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### 广播

#### 对行广播

In [158]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [159]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [160]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [161]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

对不齐也可以广播

In [162]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [163]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

#### 对列广播
需要使用函数

In [164]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [165]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [166]:
frame.add(series2)

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [167]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [168]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0